A = [
    0   1                   0;
    0   -beq/Jeq            (3/2)*Pp*lambda_rm/Jeq;
    0   -Pp*lambda_rm/Lq    -Rs/Lq];

B = [0; 0;  1/Lq];

C1 = [1  0   0];
C2 = [0  1   0];

%% Анализ управляемости системы LTI

CC = [B      A*B     A^2*B];

disp("Диапазон матрицы управляемости: " + rank(CC));

%% Анализ наблюдаемости системы  LTI

disp("Наблюдаемость углового положения : ");
OO = [C1;    C1*A;    C1*A^2];
disp("Матрица наблюдаемости: " + rank(OO));

disp("Наблюдаемость угловой скорости : ");
OO = [C2;    C2*A;    C2*A^2];
disp("Матрица наболюдаемости: " + rank(OO));
